---
title: InsulationTypeSet
classe: Autodesk.Revit.DB.Electrical.InsulationTypeSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# InsulationTypeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `insulationTypeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `insulationTypeSet.Size` | Int32 |
| `Void Clear()` | `insulationTypeSet.Clear()` | Void |
| `Boolean Contains(InsulationType)` | `insulationTypeSet.Contains(item)` | Boolean |
| `Int32 Erase(InsulationType)` | `insulationTypeSet.Erase(item)` | Int32 |
| `InsulationTypeSetIterator ForwardIterator()` | `insulationTypeSet.ForwardIterator()` | InsulationTypeSetIterator |
| `IEnumerator GetEnumerator()` | `insulationTypeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(InsulationType)` | `insulationTypeSet.Insert(item)` | Boolean |
| `InsulationTypeSetIterator ReverseIterator()` | `insulationTypeSet.ReverseIterator()` | InsulationTypeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```